Revit 2027 API
NurbSpline.Create Method
 Creates a new geometric NurbSpline object from a HermiteSpline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NurbSpline Create(
	HermiteSpline hermiteSpline
)
Public Shared Function Create (
	hermiteSpline As HermiteSpline
) As NurbSpline
public:
static NurbSpline^ Create(
	HermiteSpline^ hermiteSpline
)
static member Create :
        hermiteSpline : HermiteSpline -> NurbSpline
Parameters
hermiteSpline HermiteSpline
 The hermite spline that will be converted to NurbSpline.
Return Value
NurbSpline
 The new NurbSpline object.
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace